2024/Fichiers_tex/rapport-2024-09-20.tex
% Created 2024-09-20 Fri 10:28
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
% =================================BASE====================================%
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc
\usepackage{csquotes} % Recommandé par PDFLatex lors de la compilation. 

% Calligraphie
%\usepackage{pxfonts} % Met le texte ET les maths en Palatino + donne accès à des symboles math
%\usepackage{palatino} % Cette commande met seulement le texte en police palatino
\usepackage{lmodern} % Pour les maths? Lmodern pour les maths
\usepackage{cfr-lm}
% Use lmodern for sans-serif
\usepackage{mathrsfs} % Permet la command \mathscr (Lettres attachées genre) \mathscr(ABC)
\usepackage{eucal}   % Vient changer le \mathcal{ABC} parce que celui de base est laid.

% Bibliographie
\usepackage[backend=biber,style=alphabetic,sorting=ynt,maxbibnames=99]{biblatex}
%\usepackage[backend=biber,sorting=ynt,style=authoryear]{biblatex} % Ça semble tout changer.
\addbibresource{master-bibliography.bib}


\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.
\usepackage{mathtools,cancel,xfrac} % Utilisation de boîtes \boxed{} + \cancelto{}{}, xfrac
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage{colortbl} % Color tables
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.

% Physique
\usepackage{physics} % Meilleur package pour physicien. 

% Style
\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usetikzlibrary{arrows.meta,bending, shapes.geometric, automata, positioning} % Arrow heads et les formes de noeuds
\usepackage{empheq} % Boite autour de MULTIPLE équations
\usepackage{bbding}

% Français
\usepackage[french]{babel} % Environnements en Français.

\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate
% ==============================BASE-(END)=================================%





% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt}
\setlength{\parskip}{0.15cm}

% Tableaux/tabular
% Espace vertical dans les tabular/tableaux
\renewcommand{\arraystretch}{1.2}
% Couleur des tableaux/tabular
% \rowcolors{3}{violet!5}{}

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}


% Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 

% Les « captions » sont en italique et largeur limitée
\usepackage[textfont = it]{caption} 
\captionsetup[wrapfigure]{margin=0.5cm}

% Retirer l'écriture en gras dans la table des matières
\usepackage{tocloft}
\renewcommand{\cftsecfont}{\normalfont}
\renewcommand{\cftsecpagefont}{\normalfont}


% On a des lignes à droite des sections et sous-sections
\usepackage[explicit]{titlesec}
    % Raised Rule Command:
    % Arg 1 (Optional) - How high to raise the rule
    % Arg 2 - Thickness of the rule
    \newcommand{\raisedrulefill}[2][0ex]{\leaders\hbox{\rule[#1]{1pt}{#2}}\hfill}
    \titleformat{\section}{\Large\bfseries}{\thesection. }{0em}{#1\;\raisedrulefill[0.4ex]{0.25pt}}
    \titleformat{\subsection}{\large\bfseries}{\thesubsection. }{0em}{#1\;\raisedrulefill[0.4ex]{0.10pt}}


% Change bullet style
%\usepackage{pifont}
\usepackage{enumitem}
%\setlist[itemize,1]{label=\ding{224}}
%\setlist[itemize,1]{label=\ding{239}}
%\setlist[itemize,1]{label=$\cdot$}
\renewcommand{\boxtimes}{\blacksquare}
% ================================SETTINGS=================================%



% ==============================NEWCOMMANDS================================%
% CQFD symbol
\renewcommand{\qedsymbol}{$\hfill\blacksquare$}
\newcommand{\cqfd}{\hfill$\blacktriangleleft$}

% Vecteurs de base :
\newcommand{\nvf}{\vb{\hat{n}}}
\newcommand{\evf}{\vb{\hat{e}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\vb{\hat{j}}}
\newcommand{\kvf}{\vb{\hat{k}}}
\newcommand{\uu}{\vb{u}}
\newcommand{\vv}{\vb{v}}
\newcommand{\ust}{\vb{u}_{\ast}}
\newcommand{\xx}{\vb{x}}
\newcommand{\rad}{\text{Rad}}

% Physics empty spaces 
\newcommand{\short}{\vphantom{pA}}
\newcommand{\tall}{\vphantom{pA^{x^x}_p}}
\newcommand{\grande}{\vphantom{\frac{1}{xx}}}
\newcommand{\venti}{\vphantom{\sum_x^x}}
\newcommand{\pt}{\hspace{1pt}} % One horizontal pt space

% Moyenne numérique entre deux points de grilles. 
\newcommand{\xmean}[1]{\overline{#1}^x}
\newcommand{\ymean}[1]{\overline{#1}^y}
\newcommand{\zmean}[1]{\overline{#1}^z}
\newcommand{\xymean}[1]{\overline{#1}^{xy}}

% Tilde over psi
\newcommand{\tpsi}{\tilde{\psi}}
\newcommand{\tphi}{\tilde{\phi}}

% Nota Bene env : (\ding{89})
%\newcommand{\nb}{$\boxed{\text{\footnotesize\EightStarConvex}\pt \mathfrak{N. B.}}$\hspace{4pt}}
\newcommand{\nb}{\underline{{\footnotesize\EightStarConvex}\pt $\mathfrak{N.B.}$\vphantom{p}}\hspace{3pt}}

\newcommand{\exemple}{
\parbox[center]{2.2cm}{\begin{tcolorbox}[sharp corners, rounded corners=northeast, rounded corners=southeast,
colback=Violet!2, colframe=black,
size=small, width=2cm, left=-0.25pt, bottom=-0.5pt,
arc is angular, arc=2.5mm, boxrule=0.35pt, leftrule=4pt, %bottomrule=1pt,
after={\enskip}] Exemple \end{tcolorbox}}}

% Define the nota bene environment
\usepackage{tcolorbox}
\newtcolorbox{notabene}{
     colback=blue!5,
     colframe=black,
     boxrule=0.5pt,
     arc=2pt,
     left=5pt,
     right=5pt,
     top=5pt,
     bottom=5pt,
}


\newcommand{\cmark}{\ding{52}}
\newcommand{\xmark}{\ding{55}}

%\newcommand{\fourier}[1]{\raisebox{-0.4em}{\resizebox{2em}{!}{$\mathscr{F}$}\,}\qty[#1]}
\newcommand{\fourier}{\operatorname{\raisebox{-0.4em}{\resizebox{2em}{!}{$\mathscr{F}$}}}}
% Mettre (a,b) à la suite d'une série d'équations horizontales.
\newcommand{\ab}{\refstepcounter{equation}\tag{\theequation a,b}}
% ==============================NEWCOMMANDS================================%



% ==============================PAGE-TITRE=================================%
% Titlepage 
\newcommand{\mytitlepage}{
\begin{titlepage}
\begin{center}
{\Huge \thesubtitle \par}
\vspace{2cm}
{\Huge \MakeUppercase{\thetitle} \par}
\vspace{2cm}
RÉALISÉ DANS LE CADRE\\ D'UN PROJET POUR \par
\vspace{2cm}
{\Huge ISMER--UQAR \par}
\vspace{2cm}
{\thedate}
\end{center}
\vfill
Rédaction \\
{\theauthor}\\
\url{charles-edouard.lizotte@uqar.ca}\\
ISMER-UQAR\\
Police d'écriture : \textbf{CMU Serif Roman}
\end{titlepage}
}
% ==============================PAGE-TITRE=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}
\renewcommand{\headrulewidth}{0.0pt} % Ligne horizontale en haut

\fancyhead[R]{\underline{\textit{Section \thesubsection}}}
\fancyhead[L]{\underline{\textit{\thepage}}}
\fancyfoot[R]{\textit{\theauthor}}
\fancyfoot[L]{}
\fancyfoot[C]{} 
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{20/09/2024}
\title{Rapport hebdomadaire}
\newcommand{\thesubtitle}{Contrat Été 2024}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Rapport hebdomadaire},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={French}}
\begin{document}

\mytitlepage
\tableofcontents\newpage
\section{Objectifs principaux des prochaines semaines [0/0]}
\label{sec:org5e827ef}

\subsection{Développer une « config » préliminaire de Wavewatch [1/1]}
\label{sec:org84be140}

\begin{itemize}
\item[{$\boxtimes$}] Il faut premièrement installer Wavewatch III sur mes machines (On teste sur la mienne en premier, comme ça je pourrai exporter mon environnement sur les machines du PolR ou de \emph{Compute Canada};
\item\relax [0/4] Faut vérifier que Wavewatch III fonctionne bien.
\begin{itemize}
\item[{$\square$}] \emph{grid input} main genre une ligne; Si je me souviens bien, j'ai déjà une fonction Python qui réalise ce genre de fichiers d'entrée (Voir les codes de la maîtrise);
\item[{$\square$}] \emph{startfile};
\item[{$\square$}] \emph{NetCDF input} genre un courant et un vent;
\item[{$\square$}] \emph{Shell input};
\end{itemize}
\end{itemize}
\subsection{Mettre le terme non-linéaire dans le code Julia  [2/3]}
\label{sec:org0392e1c}

\begin{itemize}
\item[{$\boxtimes$}] Je doit impérativement contacter Sébastien Dugas
\item[{$\boxtimes$}] Voir la preuve fournie dans le livre \autocite{kinsman1965their},
\item[{$\square$}] Trouver un équivalent en 1 dimension.
\end{itemize}
\subsection{Caractérisation des distributions de floes}
\label{sec:orgce40586}

\begin{itemize}
\item[{$\square$}] Il faut créer une fonction en Python qui crée des distributions de glaces avec les paramètres nécessaires;
\begin{itemize}
\item Concentration de glace \(C_g\),
\item Taille des \emph{patches},
\item Orientation de la distribution
\end{itemize}
\end{itemize}
\section{Config de Wavewatch III}
\label{sec:org4c4df03}

\subsection{Installation de Wavewatch}
\label{sec:orge67bc0a}

J'ai déjà écrit tout ça dans un rapport avec Louis-Philippe, mais je trouve que c'est important de faire une petite mise à jour avant de se remettre dedans. De plus, ça pourrait être utile à tous les nouveaux employés qui me poseront une question là-dessus.

Avant tout, il faut aller sur \url{https://polar.ncep.noaa.gov/waves/wavewatch/distribution/}, c'est là qu'on peut télécharger le modèle sous forme de fichier \emph{.tar} avec les informations
\begin{verbatim}
 >>> username: converter1091
 >>> password: contractor8409
\end{verbatim}
On s'assure d'avoir la version la plus à jour, dans mon cas, c'est la 5.16. Une fois que c'est téléchargé, on peut ouvrir le fichier compressé dans un dossier au choix,
\begin{verbatim}
 >>> tar -xvf wwatch3.v5.16.tar.gz -C wavewatch3
\end{verbatim}
On va dans le dossier, on rend l'installateur executable avec
\begin{verbatim}
 >>> chmod +x install_ww3_tar 
\end{verbatim}
On peut essayer, mais si nous n'avons pas de compilateur Fortran ou C, ça ne sert pas à grand chose. Pour Arch Linux, on peut tout simplement installer \emph{Gfortran} à l'aide de la commande
\begin{verbatim}
 >>> sudo pacman -Syyu gcc-fortran
\end{verbatim}
Mentionnons qu'on a besoin de NetCDF aussi, alors -- si l'on ne l'a pas déjà -- on peut l'installer à l'aide de
\begin{verbatim}
 >>> sudo pacman -S netcdf-fortran 
\end{verbatim}
et on peut vérifier l'installation à l'aide de
\begin{verbatim}
 >>> nc-config --version
 OUT /usr/bin/nc-config
\end{verbatim}
puis trouver où il est installé à l'aide
\begin{verbatim}
 >>> which nc-config
 OUT /usr/bin/nc-config
\end{verbatim}
Finalement, il faut ajouter quelques lignes à notre fichier bash. Grossièrement, on ajoute le dossier \emph{bin} et le dossier \emph{exe} à notre \emph{\$PATH}, ainsi que les configurations pour utiliser NetCDF. Donc, on met
\begin{verbatim}
 >>> export WWATCH3_NETCDF=NC4
 >>> export NETCDF_CONFIG=/usr/bin/nc-config
 >>> PATH=$PATH:/home/charlesedouard/Desktop/Travail/ww3/bin
 >>> PATH=$PATH:/home/charlesedouard/Desktop/Travail/ww3/exe
 >>> export PATH
\end{verbatim}
Et tout devrait être dans la poche, même s'il y aura certainnement quelques ajustement à faire.
\subsection{Création de la configuration à l'aide des switches désirées}
\label{sec:orge3896af}

Dans le dossier \emph{bin}, on peut faire
\begin{verbatim}
 >>> ./w3_setup /home/charlesedouardl/Desktop/Travail/wavewatch3 -c gfortran -s lizotte
\end{verbatim}
pour s'assurer qu'on utilise les switches désirées. Ensuite, on peut faire le fameux
\begin{verbatim}
 >>> ./w3_make
\end{verbatim}
Finalement, il faut souvent repartir le terminal parce que le \emph{.bashrc} n'a pas été mis à jour.\bigskip

Alors maintenant, il faut les bonnes \emph{switches}.



\newpage
\subsection{Input du modèle}
\label{sec:orgc98c3a5}

On se souvient de la maîtrise de Eliot Bismuth, on doit donc garder en mémoire le tableau 4 qui contient toutes les infos

\begin{table}[!h]
\caption{Tableau tiré de la maîtrise d'Éliot Bimuth.}
\centering
\begin{tabular}{lcrc}
\hline
\hline
Description de la variable & Symbole & Valeur & Unités\\
\hline
Taille de la grille & \(L_x\) & 5 & km\\
Taille des points de grille & \(\Delta x\) & 500 & m\\
Nombre de points de grille & \(n_x\) & 10 & --\\
Épaisseur des floes & \(h\) & 0.5 & m\\
Diamètre moyen des floes & \(\expval{D}\) & 200 & m\\
Période du maximum spectral & \(T_p\) & 6 & s\\
Fréquence du maximum spectral & \(f_p\) & 1/6 & \(\mathrm{s}^{-1}\)\\
Hauteur significative des vagues & \(H_s\) & 1 & m\\
Minimum de fréquence du modèle & \(f_{min}\) & 1/20 & \(\mathrm{s}^{-1}\)\\
Maximum de fréquence du modèle & \(f_{max}\) & 1/2.5 & \(\mathrm{s}^{-1}\)\\
Nombre de fréquences du modèle & \(n_f\) & 61 & --\\
\hline
\end{tabular}
\end{table}


Mentionnons aussi que d'autres quantités sont importantes lorsqu'on crée la configuration du modèle.
C'est pourquoi le tableau suivant est important.

\begin{table}[!h]
\caption{D'autres quantités qui seraient importante lors de la modélisation avec Wavewatch III.}
\centering
\begin{tabular}{lcrcl}
\hline
\hline
Description & Symbole & Valeur & Unités & Note\\
\hline
Champ gravitationnel & \(g\) & 9.81 & \(\mathrm{ms}^{-2}\) & --\\
Vitesse de phase & \(c_p\) & (max) 38.52 & \(\mathrm{ms}^{-1}\) & \(c_p = g/\omega\)\\
Vitesse de groupe & \(c_g\) & (max) 19.26 & \(\mathrm{ms}^{-1}\) & \(c_g = c_p/2\)\\
Pas de temps & \(\Delta t\) & 25.00 & s & \(\Delta t < \Delta x/c^{max}_g\)\\
 &  &  &  & \\
\end{tabular}
\end{table}
\section{Bibliographie}
\label{sec:org4e3e49d}
\printbibliography
\end{document}
